title: PsExec Service Installation
id: db9cbcc0-7d8e-46ba-9f3e-cc0772c37a41
status: experimental
description: >
  Detects the PSEXESVC service binary dropped/run by PsExec, frequently abused
  for remote execution and lateral movement.
references:
  - https://attack.mitre.org/techniques/T1569/002/
author: Bvlik
date: 2026/06/21
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    Image|endswith: '\PSEXESVC.exe'
  condition: selection
falsepositives:
  - Sysadmins legitimately using PsExec for remote administration
level: medium
tags:
  - attack.execution
  - attack.lateral-movement
  - attack.t1569.002
